org/roam/machine_learning.org
:PROPERTIES:
:ID:       187181c4-598e-4373-96e0-b66b5c676d23
:END:
#+title: machine-learning
#+OPTIONS: toc:nil num:nil date:nil \n:nil html-style:nil author:nil timestamp:nil title:nil html-postamble:nil html5-fancy:t
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org-default.css" />
#+HTML_CONTENT_CLASS: container content
#+HTML_DOCTYPE: html5
#+INCLUDE: "css.org::navbar" :only-contents t
* Machine learning
** notes
- huggingface is a hub for models with api libs using pytorch/tensorflow/jax
  - spaces to run in notebook like without colab using gradio
- collab gives free 12hrs of compute
- Forward Forward is alternative back propagation
- wasi-nn for evaluating ml models in wasm via SIMD extensions with either wasmedge (pytorch) or wasmtime(openvino)
- [[https://github.com/microsoft/onnxruntime][ONNX]] for browser evaluation of pytorch models
- usually models can be quantized (compressed) by changing the float tensor values from fp16 to int8 with little loss
** image generation
  - dalle mini
  - [[https://github.com/hlky/stable-diffusion][stable diffusion]]
    - [[https://github.com/andreasjansson/cog-stable-diffusion/tree/animate][animation with interpolation]]
    - [[https://github.com/carson-katri/dream-textures][dreambooth plugin for blender textures]]
    - [[https://github.com/riffusion/riffusion-app][Generate music from spectrograph]]
    - [[https://github.com/lllyasviel/ControlNet][Controlnet]] guided Stable diffusion from scribbles/images/depth maps
** Large Language Models
  - [[https://github.com/facebookresearch/llama][Llama]]
    - weights unpublished
      - torrent ~magnet:?xt=urn:btih:ZXXDAUWYLRUXXBHUYEMS6Q5CE5WA3LVA&dn=LLaMA~ (hugginface has several copies too)
    - more than 1,000,000 hours of 40GiB GPU (400 watts) compute hours for 65B model
      - 1000 tons of CO2 (2.6 million KWh hours)
    - [[https://github.com/markasoftware/llama-cpu/commit/3f0326e9d2e567d573cce2479eb71a1262af8a93][cpu patch]]
    - [[https://github.com/tloen/llama-int8][int8 patch]]
*** Codegen
  - [[https://github.com/moyix/fauxpilot][Fauxpilot]]
    - uses salesforce/Codegen which supports natural language input and generation of C, C++, Go, Java, JavaScript, Python (BIG QUERY).
      - specialized in python with the BIGPYTHON dataset
    - Converts salesforce/codegen model into GPTJ
** Speech to text
  - open ai whisper
#+NAME: yt-translate
#+BEGIN_SRC sh :tangle no
pip install --user git+https://github.com/openai/whisper.git
pip install --user yt-dlp
VID="TyvE8oexEAA"
yt-dlp https://www.youtube.com/watch?v=${VID} --format m4a -o "%(id)s.%(ext)s"
whisper "/content/${VID}.m4a" --model small --language English
#+END_SRC
** Text to speech
- [[https://github.com/neonbjb/tortoise-tts][tortoise-tts]] based on dalle
- [[https://github.com/coqui-ai/TTS][coqui-ai]] with YourTTS voice cloning
